app/controllers/admins_controller.rb

  def create
    admin = Admin.create(admin_params)
---
INSERT INTO "admins" ("full_name", "email", "password_digest", "store_id", "created_at", "updated_at", "status", "token", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

def show
    admin = Admin.find_by_id(params[:id])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

def destroy
    admin = Admin.find_by(id: params[:id])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]