app/controllers/sessions_controller.rb

    def clerk_login
        user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "joe254@gmail.com"], ["LIMIT", 1]]

    def admin_login
        admin= Admin.find_by(email: params[:email])
---
SELECT "admins".* FROM "admins" WHERE "admins"."email" = $1 LIMIT $2  [["email", "bee254@gmail.com"], ["LIMIT", 1]]

    def user_login
        user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "joe254@gmail.com"], ["LIMIT", 1]]