app/controllers/sessions_controller.rb

    def admin_login
        user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "joe254@gmail.com"], ["LIMIT", 1]]